# 1.
# Є список
# as = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89].
# Виведіть всі елементи, які менше 5. (бажано застосувати магію)
# *магія - list comprehantion

as_list = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
result = [x for x in as_list if x < 5]
print(result)


# 2.
# Є списки
# as = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89];
# ba = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13].
# Потрібно повернути список, який складається з елементів, загальних цих двох списків.

ast = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
ba = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]

common_elements = [x for x in ast if x in ba]
print(common_elements)

# 3.
# Є списки
# arr = [6, 6, 2, 1, 5, 8, 13, 21, 34, 55, 89];
# bar = [1, 18, 3, 4, 5, 9, 7, 8, 9, 10, 11, 12, 13].
# Потрібно повернути список, який складається лише з унікальних елементів, що знаходяться в обох списках. ТОбто елементів, що не повторюються, в обох списках.

arr = [6, 6, 2, 1, 5, 8, 13, 21, 34, 55, 89]
bar = [1, 18, 3, 4, 5, 9, 7, 8, 9, 10, 11, 12, 13]

unique_elements = list(set([x for x in arr if x in bar]))
print(unique_elements)
